Show / Hide Table of Contents
Class GrpcReflectionServiceAttribute
Determines that interface decorated with this attribtue is a grpc reflection service.
Inheritance
System.Object
System.Attribute
GrpcReflectionServiceAttribute
Implements
System.Runtime.InteropServices._Attribute
Inherited Members
 System.Attribute.GetCustomAttributes(System.Reflection.MemberInfo, System.Type)
 System.Attribute.GetCustomAttributes(System.Reflection.MemberInfo, System.Type, System.Boolean)
 System.Attribute.GetCustomAttributes(System.Reflection.MemberInfo)
 System.Attribute.GetCustomAttributes(System.Reflection.MemberInfo, System.Boolean)
 System.Attribute.IsDefined(System.Reflection.MemberInfo, System.Type)
 System.Attribute.IsDefined(System.Reflection.MemberInfo, System.Type, System.Boolean)
 System.Attribute.GetCustomAttribute(System.Reflection.MemberInfo, System.Type)
 System.Attribute.GetCustomAttribute(System.Reflection.MemberInfo, System.Type, System.Boolean)
 System.Attribute.GetCustomAttributes(System.Reflection.ParameterInfo)
 System.Attribute.GetCustomAttributes(System.Reflection.ParameterInfo, System.Type)
 System.Attribute.GetCustomAttributes(System.Reflection.ParameterInfo, System.Type, System.Boolean)
 System.Attribute.GetCustomAttributes(System.Reflection.ParameterInfo, System.Boolean)
 System.Attribute.IsDefined(System.Reflection.ParameterInfo, System.Type)
 System.Attribute.IsDefined(System.Reflection.ParameterInfo, System.Type, System.Boolean)
 System.Attribute.GetCustomAttribute(System.Reflection.ParameterInfo, System.Type)
 System.Attribute.GetCustomAttribute(System.Reflection.ParameterInfo, System.Type, System.Boolean)
 System.Attribute.GetCustomAttributes(System.Reflection.Module, System.Type)
 System.Attribute.GetCustomAttributes(System.Reflection.Module)
 System.Attribute.GetCustomAttributes(System.Reflection.Module, System.Boolean)
 System.Attribute.GetCustomAttributes(System.Reflection.Module, System.Type, System.Boolean)
 System.Attribute.IsDefined(System.Reflection.Module, System.Type)
 System.Attribute.IsDefined(System.Reflection.Module, System.Type, System.Boolean)
 System.Attribute.GetCustomAttribute(System.Reflection.Module, System.Type)
 System.Attribute.GetCustomAttribute(System.Reflection.Module, System.Type, System.Boolean)
 System.Attribute.GetCustomAttributes(System.Reflection.Assembly, System.Type)
 System.Attribute.GetCustomAttributes(System.Reflection.Assembly, System.Type, System.Boolean)
 System.Attribute.GetCustomAttributes(System.Reflection.Assembly)
 System.Attribute.GetCustomAttributes(System.Reflection.Assembly, System.Boolean)
 System.Attribute.IsDefined(System.Reflection.Assembly, System.Type)
 System.Attribute.IsDefined(System.Reflection.Assembly, System.Type, System.Boolean)
 System.Attribute.GetCustomAttribute(System.Reflection.Assembly, System.Type)
 System.Attribute.GetCustomAttribute(System.Reflection.Assembly, System.Type, System.Boolean)
 System.Attribute.Equals(System.Object)
 System.Attribute.GetHashCode()
 System.Attribute.Match(System.Object)
 System.Attribute.IsDefaultAttribute()
 System.Attribute.System.Runtime.InteropServices._Attribute.GetTypeInfoCount(System.UInt32)
 System.Attribute.System.Runtime.InteropServices._Attribute.GetTypeInfo(System.UInt32, System.UInt32, System.IntPtr)
 System.Attribute.System.Runtime.InteropServices._Attribute.GetIDsOfNames(System.Guid, System.IntPtr, System.UInt32, System.UInt32, System.IntPtr)
 System.Attribute.System.Runtime.InteropServices._Attribute.Invoke(System.UInt32, System.Guid, System.UInt32, System.Int16, System.IntPtr, System.IntPtr, System.IntPtr, System.IntPtr)
 System.Attribute.TypeId
 System.Object.ToString()
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc.Reflection
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[AttributeUsage(AttributeTargets.Interface)]
public class GrpcReflectionServiceAttribute : Attribute, _Attribute
Implements
 System.Runtime.InteropServices._Attribute
 Improve this Doc
 View Source